---
kind: type
id: T:Autodesk.Revit.DB.AdaptiveComponentInstanceUtils
source: html/786db8ac-a051-37e4-7b4c-dbf286fe9a7c.htm
---
# Autodesk.Revit.DB.AdaptiveComponentInstanceUtils

An interface for Adaptive Component Instances.

## Syntax (C#)
```csharp
public static class AdaptiveComponentInstanceUtils
```